#include <stdio.h>
int *max(int *i, int *j) {      /*定义一个函数求两个数的较大值，返回一个指针*/
        int *p;                 /*定义一个指针，存储结果*/
        if (*i > *j) {         /*比較兩個指針所指向變量的大小*/
            p = i;              /*指針i賦值給指針p*/
        }
        else {
            p = j;              /*另一種情況是，指針j賦值給指針p*/
        }
        return(p);              /*返回指針p*/
}

int main() {                    /*程序的主函數*/
    int i, j;                   /*定義兩個變量*/
    int *q;                     /*定義一個指向整型變量的指針*/
    i = 5;                      /*變量賦初值*/
    j = 3;
    q = max(&i,&j);             /*取兩個數的指針作爲參數，求兩個數的較大值
                                  函數會返回較大數的指針*/
    printf("max = %d",*q);
}
