#include <stdio.h>
char *stradd(char *a, char *b) {    /*定義一個鏈接字符串數，參數是兩個指針，返回一個指針*/
    char *p;                        /*定義一個指針p*/
    p = a;                          /*把指針p賦值給指針a*/
    while (*a != 0) {               /*如果指針a指向的變量不爲空字符，則進行循環*/
        a++;                        /*指針a指向下一個變量*/
    }
    while (*b != 0) {               /*如果指針b指向的變量不爲空字符，則進行循環*/
        *a = *b;                    /*指針b指向的字符賦值給指針c指向的字符*/
        b++;                        /*指針b指向下一個字符*/
        a++;                        /*指針a指向下一個字符*/
    }
    return(p);                      /*返回指針p，也就是返回原來的指針a*/
}

int main() {
    char a[30] = "abcdefg";         /*定義一個字符串數組a,賦除值*/
    char b[30] = "HIJKLMN";         /*定義一個字符串數組b,賦初值*/
    char *c;                        /*定義一個指向字符的指針c*/
    printf("a: %s\n",a);            /*輸出地一個字符串數組a*/
    printf("b: %s\n",b);            /*輸出第二個字符串數組b*/
    c = stradd(a,b);                /*調用函數，鏈接兩個字符串數組，然後返回一個指針*/
    printf("c: %s\n",c);            /*輸出這個指針所指向的字符數組*/
}
